import { lang } from "../../lang";


export default <lang>{
    //main
    "下载全部图片": "تحميل جميع الصور",
    "上传全部图片": "رفع جميع الصور",

    //utils
    "自动上传": "التحميل التلقائي",
    "自动下载": "التنزيل التلقائي",
    "下载文件不是允许的图片类型": "الملف الذي تم تنزيله ليس من نوع الصورة المسموح به",
    "待上传图片不存在": "لا توجد صور للتحميل",
    "图片文件创建失败:": "فشل في إنشاء ملف الصورة: تحقق من صلاحيات إنشاء الملفات",
    "网络错误,请检查网络是否通畅": "خطأ في الشبكة، يرجى التحقق من اتصال الشبكة",

    // setting
    "通用": "الإعدادات العامة",
    "API 网关": "بوابة API",
    "是否自动上传": "هل تفعيل التحميل التلقائي؟",
    "如果关闭,您只能手动上传图片": "إذا تم تعطيله، يمكنك رفع الصور يدويًا فقط",
    "是否自动下载": "هل تفعيل التنزيل التلقائي؟",
    "如果关闭,您只能手动下载图片": "إذا تم تعطيله، يمكنك تنزيل الصور يدويًا فقط",
    "上传间隔时间": "فاصل تحميل الصور",
    "单位为毫秒,默认设置1s": "الوحدة هي الملي ثانية، الإعداد الافتراضي هو 1 ثانية",
    "关闭提示": "إيقاف الإشعارات",
    "关闭右上角结果提示": "إيقاف إشعارات النتائج في الزاوية اليمنى العليا",
    "下载": "تنزيل",
    "下载域名排除": "استبعاد النطاقات من التنزيل",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "عناوين الصور في قائمة الاستبعاد لن يتم تنزيلها. سطر واحد لكل نطاق، يدعم الرموز البديلة *",
    "上传": "رفع",
    "API 网关地址": "عنوان بوابة API",
    "Custom Image Gateway 地址": "عنوان بوابة API للصور",
    "API 访问令牌": "رمز الوصول إلى API",
    "用于访问API的令牌": "رمز للوصول إلى API",
    "输入您的 API 访问令牌": "أدخل رمز الوصول إلى API الخاص بك",
    "输入您的 Custom Image Gateway 地址": "إعداد خدمة API",
    "项目地址": "عنوان المشروع",
    "是否上传后删除原图片": "هل يجب حذف الصورة الأصلية بعد الرفع؟",
    "在图片上传后是否删除本地原图片": "هل يجب حذف الصورة الأصلية محليًا بعد الرفع؟",
    "支持": "الدعم",
    "捐赠": "التبرع",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "إذا كنت تحب هذا الملحق، يرجى التفكير في التبرع لدعم تطويره المستمر",
    "复制 Debug 信息": "نسخ معلومات التصحيح",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "تم نسخ معلومات التصحيح إلى الحافظة، قد تحتوي على معلومات حساسة!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "افتح وحدة التحكم باستخدام اختصار لوحة المفاتيح، يمكنك رؤية سجلات هذا الملحق والملحقات الأخرى",

    "不处理": "لا تعالج",
    "等比左上填充(裁剪)": "تعبئة بنسبة متساوية من الزاوية العلوية اليسرى (اقتصاص)",
    "等比居中填充(裁剪)": "تعبئة بنسبة متساوية من المنتصف (اقتصاص)",
    "固定尺寸拉伸": "تمدد بحجم ثابت",
    "等比适应": "التناسب بنسبة متساوية",
    "笔记正文图片": "صورة نص الملاحظة",
    "笔记属性图片": "صورة خاصية الملاحظة",
    "设置图片压缩模式, 0不限制, 最大值不会超过服务端相关设置": "تعيين وضع ضغط الصورة ، 0 لا قيود ، القيمة القصوى لا تتجاوز إعدادات الخادم ذات الصلة",
    "正文图片": "صورة النص",
    "宽度": "العرض",
    "高度": "الارتفاع",
    "调整压缩": "تعديل الضغط",
    "属性": "الخاصية",
    "添加属性图片上传": "إضافة رفع صورة الخاصية",
    "选择属性": "اختيار الخاصية",


    "图片上传地址增加随机查询": "إضافة سطر عشوائي إلى عنوان رفع الصورة لتجنب تخزين الصور في CDN",
    "在图片地址末尾增加随机查询,用于规避CDN缓存": "إضافة سطر عشوائي إلى عنوان رفع الصورة لتجنب تخزين الصور في CDN",
    "一键上传下载": "رفع وتنزيل واحد",
};
