import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "Спампаваць усе выявы",
    "上传全部图片": "Загрузіць усе выявы",

    //utils
    "自动上传": "Аўтаматычная загрузка",
    "自动下载": "Аўтаматычнае спампаванне",
    "下载文件不是允许的图片类型": "Загружаны файл не з'яўляецца дазволеным тыпам выявы",
    "待上传图片不存在": "Няма малюнкаў для загрузкі",
    "图片文件创建失败:": "Памылка стварэння файла выявы: праверце правы на стварэнне файлаў",
    "网络错误,请检查网络是否通畅": "Памылка сеткі, калі ласка, праверце злучэнне з сеткай",

    // setting
    "通用": "Агульныя налады",
    "是否自动上传": "Уключыць аўтаматычную загрузку?",
    "如果关闭,您只能手动上传图片": "Калі адключыць, вы зможаце загружаць выявы толькі ўручную",
    "是否自动下载": "Уключыць аўтаматычнае спампаванне?",
    "如果关闭,您只能手动下载图片": "Калі адключыць, вы зможаце спампаваць выявы толькі ўручную",
    "上传间隔时间": "Інтэрвал загрузкі",
    "单位为毫秒,默认设置1s": "Адзінка ў мілісекундах, стандартная настройка 1 секунда",
    "关闭提示": "Адключыць апавяшчэнні",
    "关闭右上角结果提示": "Адключыць апавяшчэнні аб выніках у верхнім правым вуглу",
    "下载": "Спампаваць",
    "下载域名排除": "Выключэнне даменаў для спампоўкі",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "Адрасы выяў у спісе выключэнняў не будуць загружаныя. Па адным дамене на радок, падтрымлівае выкарыстанне шаблона *",
    "上传": "Загрузіць",
    "API 地址": "Адрас API",
    "Image Api Gateway 地址": "Адрас шлюзу API выявы",
    "API 访问令牌": "Токен доступу API",
    "用于访问API的令牌": "Токен для доступу да API",
    "输入您的 API 访问令牌": "Увядзіце ваш токен доступу да API",
    "API 服务搭建": "Наладзіць API сэрвіс",
    "项目地址": "Адрас праекта",
    "是否上传后删除原图片": "Ці трэба выдаліць арыгінальную выяву пасля загрузкі?",
    "在图片上传后是否删除本地原图片": "Ці трэба выдаліць арыгінальную выяву лакальна пасля загрузкі?",
    "支持": "Падтрымка",
    "捐赠": "Падтрыманне",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "Калі вам падабаецца гэты плагін, разгледзьце магчымасць зрабіць ахвяраванне для падтрымкі далейшага развіцця",
    "复制 Debug 信息": "Капіяваць інфармацыю аб адладцы",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "Інфармацыя аб адладцы была скапіявана ў буфер абмену, яна можа ўтрымліваць адчувальную інфармацыю!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "Адкрыйце кансоль з дапамогай гарачых клавіш, каб убачыць лагі гэтага плагіна і іншых плагінаў"
};
