import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "Спампаваць усе выявы",
    "上传全部图片": "Загрузіць усе выявы",

    //utils
    "自动上传": "Аўтаматычнае загружэнне",
    "自动下载": "Аўтаматычнае спампаванне",
    "下载文件不是允许的图片类型": "Файл для спампоўкі не з'яўляецца дазволеным тыпам выявы",
    "待上传图片不存在": "Выява для загрузкі не існуе",
    "图片文件创建失败:": "Памылка пры стварэнні файла выявы:",
    "网络错误,请检查网络是否通畅": "Памылка сеткі, праверце злучэнне",

    // setting
    "通用设置": "Агульныя налады",
    "是否自动上传": "Аўтаматычнае загружэнне",
    "如果关闭,您只能手动上传图片": "Калі адключыць, вы зможаце загружаць выявы толькі ўручную",
    "是否自动下载": "Аўтаматычнае спампаванне",
    "如果关闭,您只能手动下载图片": "Калі адключыць, вы зможаце спампоўваць выявы толькі ўручную",
    "上传间隔时间": "Інтэрвал загрузкі",
    "单位为毫秒,默认设置1s": "Адзінка ў мілісекундах, стандартнае значэнне — 1 секунда",
    "关闭提示": "Выключыць апавяшчэнні",
    "关闭右上角结果提示": "Выключыць апавяшчэнні ў правым верхнім вугле",
    "下载设置": "Налады спампоўкі",
    "下载域名排除": "Выключэнне даменаў для спампоўкі",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "Адрасы малюнкаў у спісе выключэнняў не будуць загружаны. Адзіны дамен на радок, падтрымліваецца сімвал *",
    "上传设置": "Налады загрузкі",
    "API 地址": "Адрас API",
    "Image Api Gateway 地址": "Адрас API-шлюза для малюнкаў",
    "API 访问令牌": "Токен доступу да API",
    "用于访问API的令牌": "Токен для доступу да API",
    "输入您的 API 访问令牌": "Увядзіце свой токен доступу да API",
    "API 服务搭建": "Налада службы API",
    "项目地址": "Адрас праекта",
    "是否上传后删除原图片": "Выдаліць арыгінальную выяву пасля загрузкі?",
    "在图片上传后是否删除本地原图片": "Выдаліць лакальную арыгінальную выяву пасля загрузкі?",
    "支持": "Падтрымка",
    "捐赠": "Падтрыманне",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "Калі вам падабаецца гэты плагін, разгледзьце магчымасць ахвяравання для падтрымкі далейшага развіцця.",
    "复制 Debug 信息": "Капіяваць інфармацыю аб адладцы",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "Капіяваць інфармацыю аб адладцы ў буфер абмену. Можа ўтрымліваць канфідэнцыяльныя дадзеныя!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "Адкрыйце кансоль з дапамогай гарачых клавіш, каб убачыць лагі гэтага плагіна і іншых плагінаў"
};
