import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "הורד את כל התמונות",
    "上传全部图片": "העלה את כל התמונות",

    //utils
    "自动上传": "העלאה אוטומטית",
    "自动下载": "הורדה אוטומטית",
    "下载文件不是允许的图片类型": "הקובץ שהורד אינו סוג תמונה מותר",
    "待上传图片不存在": "אין תמונה להעלות",
    "图片文件创建失败:": "יצירת קובץ התמונה נכשלה: בדוק את הרשאות יצירת הקובץ",
    "网络错误,请检查网络是否通畅": "שגיאת רשת, אנא בדוק את חיבור הרשת",

    // setting
    "通用": "הגדרות כלליות",
    "是否自动上传": "האם להפעיל העלאה אוטומטית?",
    "如果关闭,您只能手动上传图片": "אם תכבה את האפשרות הזו, תוכל להעלות תמונות ידנית בלבד",
    "是否自动下载": "האם להפעיל הורדה אוטומטית?",
    "如果关闭,您只能手动下载图片": "אם תכבה את האפשרות הזו, תוכל להוריד תמונות ידנית בלבד",
    "上传间隔时间": "מרווח זמן להעלאה",
    "单位为毫秒,默认设置1s": "היחידה היא מילישניות, ברירת המחדל היא שנייה אחת",
    "关闭提示": "כיבוי התראות",
    "关闭右上角结果提示": "כיבוי התראות התוצאות בפינה הימנית העליונה",
    "下载": "הורד",
    "下载域名排除": "החרגת דומיינים מהורדה",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "כתובת התמונות ברשימת ההחרגה לא תורד. אחד על כל שורה, תומך בכוכבית *",
    "上传": "העלה",
    "API 地址": "כתובת API",
    "Image api 网关地址": "כתובת שער ה-API של התמונה",
    "API 访问令牌": "אסימון גישה ל-API",
    "用于访问API的令牌": "אסימון לשימוש בגישה ל-API",
    "输入您的 API 访问令牌": "הכנס את אסימון הגישה שלך ל-API",
    "API 服务搭建": "הגדרת שירות API",
    "项目地址": "כתובת הפרויקט",
    "是否上传后删除原图片": "האם למחוק את התמונה המקורית לאחר ההעלאה?",
    "在图片上传后是否删除本地原图片": "האם למחוק את התמונה המקורית המקומית לאחר ההעלאה?",
    "支持": "תמיכה",
    "捐赠": "תרומות",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "אם אהבת את התוסף הזה, שקול לתרום על מנת לתמוך בהמשך הפיתוח",
    "复制 Debug 信息": "העתק מידע ניפוי שגיאות",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "מידע הניפוי שגיאות הועתק ללוח, ייתכן שהוא מכיל מידע רגיש!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "פתח את הקונסולה בעזרת קיצור מקשים, תוכל לראות את הלוגים של תוסף זה ותוספים אחרים"
};
