import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "すべての画像をダウンロード",
    "上传全部图片": "すべての画像をアップロード",

    //utils
    "自动上传": "自動アップロード",
    "自动下载": "自動ダウンロード",
    "下载文件不是允许的图片类型": "ダウンロードファイルは許可されている画像タイプではありません",
    "待上传图片不存在": "アップロードする画像が存在しません",
    "图片文件创建失败:": "画像ファイルの作成に失敗しました:",
    "网络错误,请检查网络是否通畅": "ネットワークエラー、接続状態を確認してください",

    // setting
    "通用设置": "一般設定",
    "是否自动上传": "自動アップロード",
    "如果关闭,您只能手动上传图片": "オフにすると、画像は手動でアップロードできます",
    "是否自动下载": "自動ダウンロード",
    "如果关闭,您只能手动下载图片": "オフにすると、画像は手動でダウンロードできます",
    "上传间隔时间": "アップロード間隔時間",
    "单位为毫秒,默认设置1s": "単位はミリ秒で、デフォルトは1秒に設定されています",
    "关闭提示": "通知をオフにする",
    "关闭右上角结果提示": "右上隅の結果通知をオフにする",
    "下载设置": "ダウンロード設定",
    "下载域名排除": "ダウンロード除外ドメイン",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "除外リストにある画像のアドレスはダウンロードされません。一行に1つのドメインを入力してください、ワイルドカード*もサポートしています",
    "上传设置": "アップロード設定",
    "API 地址": "APIアドレス",
    "Image Api Gateway 地址": "画像APIゲートウェイアドレス",
    "API 访问令牌": "APIアクセスToken",
    "用于访问API的令牌": "APIにアクセスするためのトークン",
    "输入您的 API 访问令牌": "APIアクセスTokenを入力してください",
    "API 服务搭建": "APIサービスの設定",
    "项目地址": "プロジェクトアドレス",
    "是否上传后删除原图片": "アップロード後にオリジナル画像を削除しますか？",
    "在图片上传后是否删除本地原图片": "アップロード後にローカルのオリジナル画像を削除しますか？",
    "支持": "サポート",
    "捐赠": "寄付",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "このプラグインが気に入った場合は、開発を続けるために寄付を検討してください。",
    "复制 Debug 信息": "デバッグ情報をコピー",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "デバッグ情報をクリップボードにコピーします。機密情報が含まれている可能性があります！",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "ショートカットキーでコンソールを開き、このプラグインと他のプラグインのログを確認できます"
};
