import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "すべての画像をダウンロード",
    "上传全部图片": "すべての画像をアップロード",

    //utils
    "自动上传": "自動アップロード",
    "自动下载": "自動ダウンロード",
    "下载文件不是允许的图片类型": "ダウンロードしたファイルは許可された画像タイプではありません",
    "待上传图片不存在": "アップロードする画像が存在しません",
    "图片文件创建失败:": "画像ファイルの作成に失敗しました: ファイル作成の権限を確認してください",
    "网络错误,请检查网络是否通畅": "ネットワークエラー、接続状態を確認してください",

    // setting
    "通用": "一般設定",
    "是否自动上传": "自動アップロードを有効にしますか？",
    "如果关闭,您只能手动上传图片": "無効にすると、手動で画像をアップロードすることしかできません",
    "是否自动下载": "自動ダウンロードを有効にしますか？",
    "如果关闭,您只能手动下载图片": "無効にすると、手動で画像をダウンロードすることしかできません",
    "上传间隔时间": "アップロード間隔",
    "单位为毫秒,默认设置1s": "単位はミリ秒で、デフォルト設定は1秒です",
    "关闭提示": "通知を無効にする",
    "关闭右上角结果提示": "右上隅の結果通知を無効にする",
    "下载": "ダウンロード",
    "下载域名排除": "ダウンロード除外ドメイン",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "除外リストにある画像リンクはダウンロードされません。1行につき1つのドメイン、* ワイルドカードをサポートします",
    "上传": "アップロード",
    "API 地址": "APIアドレス",
    "Image Api Gateway 地址": "画像APIゲートウェイアドレス",
    "API 访问令牌": "APIアクセストークン",
    "用于访问API的令牌": "APIへのアクセスに使用するトークン",
    "输入您的 API 访问令牌": "APIアクセス用のトークンを入力してください",
    "API 服务搭建": "APIサービスの設定",
    "项目地址": "プロジェクトのアドレス",
    "是否上传后删除原图片": "アップロード後に元の画像を削除しますか？",
    "在图片上传后是否删除本地原图片": "画像をアップロード後、ローカルの元画像を削除しますか？",
    "支持": "サポート",
    "捐赠": "寄付",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "このプラグインが気に入ったら、開発を継続するために寄付をご検討ください",
    "复制 Debug 信息": "デバッグ情報をコピー",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "デバッグ情報をクリップボードにコピーしました。機密情報が含まれている可能性があります！",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "ショートカットキーでコンソールを開き、このプラグインや他のプラグインのログを確認できます"
};
