import { lang } from "../../lang";


export default <lang>{
    "Custom Image Auto Uploader": "カスタム画像自動アップロードプラグイン",
    "已开启": "有効",
    "已关闭": "無効",

    //main
    "下载全部图片": "すべての画像をダウンロード",
    "上传全部图片": "すべての画像をアップロード",

    //utils
    "自动上传下载": "自動アップロードとダウンロード",
    "自动上传": "自動アップロード",
    "自动下载": "自動ダウンロード",
    "下载文件不是允许的图片类型": "ダウンロードしたファイルは許可された画像タイプではありません",
    "待上传图片不存在": "アップロードする画像が存在しません",
    "图片文件创建失败:": "画像ファイルの作成に失敗しました: ファイル作成の権限を確認してください",
    "网络错误,请检查网络是否通畅": "ネットワークエラー、接続状態を確認してください",

    // setting
    "通用": "一般設定",
    "API 网关": "APIゲートウェイ",
    "是否自动上传": "自動アップロードを有効にしますか？",
    "如果关闭,您只能手动上传图片": "無効にすると、手動で画像をアップロードすることしかできません",
    "是否自动下载": "自動ダウンロードを有効にしますか？",
    "如果关闭,您只能手动下载图片": "無効にすると、手動で画像をダウンロードすることしかできません",
    "上传间隔时间": "アップロード間隔",
    "单位为毫秒,默认设置1s": "単位はミリ秒で、デフォルト設定は1秒です",
    "关闭提示": "通知を無効にする",
    "关闭右上角结果提示": "右上隅の結果通知を無効にする",
    "下载": "ダウンロード",
    "下载域名排除": "ダウンロード除外ドメイン",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "除外リストにある画像リンクはダウンロードされません。1行につき1つのドメイン、* ワイルドカードをサポートします",
    "上传": "アップロード",
    "API 网关地址": "APIゲートウェイアドレス",
    "Custom Image Gateway 地址": "Custom Image Gateway アドレス",
    "API 访问令牌": "APIアクセストークン",
    "用于访问API的令牌": "APIへのアクセスに使用するトークン",
    "输入您的 API 访问令牌": "APIアクセス用のトークンを入力してください",
    "输入您的 Custom Image Gateway 地址": "Custom Image Gateway のアドレスを入力してください",

    "接口配置信息已经粘贴到设置中!": "インターフェース設定情報が設定に貼り付けられました！",
    "网关服务选择": "ゲートウェイサービスの選択",
    "选择一个适合自己的网关服务": "自分に最適なゲートウェイサービスを選択してください",
    "方式": "方法",
    "说明": "説明",
    "自行搭建": "自分で構築",
    "速度好, 自由配置, 无隐私风险, 支持云存储和服务端存储": "速度が良い、自由な構成、プライバシーのリスクが低い、クラウドストレージとサーバーストレージをサポート",
    "多用户开放网关": "多ユーザー開放ゲートウェイ",
    "稳定性好, 仅支持用户的云存储": "安定性が高く、ユーザーのクラウドストレージのみをサポート",
    "粘贴多用户开放网关的接口配置": "多ユーザー開放ゲートウェイのインターフェース設定を貼り付ける",

    "未检测到配置信息!": "設定情報が検出されませんでした!",

    "项目地址": "プロジェクトのアドレス",
    "是否上传后删除原图片": "アップロード後に元の画像を削除しますか？",
    "在图片上传后是否删除本地原图片": "画像をアップロード後、ローカルの元画像を削除しますか？",
    "支持": "サポート",
    "捐赠": "寄付",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "このプラグインが気に入ったら、開発を継続するために寄付をご検討ください",
    "复制 Debug 信息": "デバッグ情報をコピー",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "デバッグ情報をクリップボードにコピーしました。機密情報が含まれている可能性があります！",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "ショートカットキーでコンソールを開き、このプラグインや他のプラグインのログを確認できます",


    "不处理": "処理しない",
    "等比左上填充(裁剪)": "左上隅からの比率に基づく塗りつぶし（切り抜き）",
    "等比居中填充(裁剪)": "中央に合わせた比率に基づく塗りつぶし（切り抜き）",
    "固定尺寸拉伸": "固定サイズで引き伸ばす",
    "等比适应": "比率に基づいた調整",
    "笔记正文图片": "ノート本文画像",
    "笔记属性图片": "ノート属性画像",
    "设置图片压缩模式, 0不限制, 最大值不会超过服务端相关设置": "画像の圧縮モードを設定します。0は制限なし、最大値はサーバー設定を超えません。",
    "正文图片": "本文画像",
    "宽度": "幅",
    "高度": "高さ",
    "调整压缩": "圧縮を調整",
    "属性": "属性",
    "添加属性图片上传": "属性画像のアップロードを追加",
    "选择属性": "属性を選択",

    "图片上传地址增加随机查询": "画像アップロードアドレスにランダムクエリを追加",
    "在图片地址末尾增加随机查询,用于规避CDN缓存": "画像アドレスの末尾にランダムクエリを追加して、CDNキャッシュを回避します",
    "一键上传下载": "一つのクリックでアップロードとダウンロード",
};
