import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "모든 이미지 다운로드",
    "上传全部图片": "모든 이미지 업로드",

    //utils
    "自动上传": "자동 업로드",
    "自动下载": "자동 다운로드",
    "下载文件不是允许的图片类型": "허용되지 않는 이미지 유형의 파일을 다운로드할 수 없습니다",
    "待上传图片不存在": "업로드할 이미지가 존재하지 않습니다",
    "图片文件创建失败:": "이미지 파일 생성 실패:",
    "网络错误,请检查网络是否通畅": "네트워크 오류, 네트워크 연결 상태를 확인하세요",

    // setting
    "通用设置": "일반 설정",
    "是否自动上传": "자동 업로드 여부",
    "如果关闭,您只能手动上传图片": "비활성화 시, 이미지를 수동으로 업로드할 수 있습니다",
    "是否自动下载": "자동 다운로드 여부",
    "如果关闭,您只能手动下载图片": "비활성화 시, 이미지를 수동으로 다운로드할 수 있습니다",
    "上传间隔时间": "업로드 간격 시간",
    "单位为毫秒,默认设置1s": "단위는 밀리초이며, 기본 설정은 1초입니다",
    "关闭提示": "알림 끄기",
    "关闭右上角结果提示": "우측 상단 결과 알림 끄기",
    "下载设置": "다운로드 설정",
    "下载域名排除": "다운로드 제외 도메인",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "제외 목록에 있는 이미지 주소는 다운로드되지 않습니다. 각 도메인은 한 줄에 하나씩 작성하며, * 와일드카드를 지원합니다",
    "上传设置": "업로드 설정",
    "API 地址": "API 주소",
    "Image Api Gateway 地址": "이미지 API 게이트웨이 주소",
    "API 访问令牌": "API 액세스 토큰",
    "用于访问API的令牌": "API에 접근하는 데 사용되는 토큰",
    "输入您的 API 访问令牌": "귀하의 API 액세스 토큰을 입력하세요",
    "API 服务搭建": "API 서비스 설정",
    "项目地址": "프로젝트 주소",
    "是否上传后删除原图片": "업로드 후 원본 이미지 삭제 여부",
    "在图片上传后是否删除本地原图片": "이미지 업로드 후 로컬 원본 이미지 삭제 여부",
    "支持": "지원",
    "捐赠": "기부",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "이 플러그인이 마음에 드신다면, 지속적인 개발을 지원하기 위해 기부를 고려해주세요.",
    "复制 Debug 信息": "디버그 정보 복사",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "디버그 정보를 클립보드에 복사합니다. 민감한 정보가 포함될 수 있습니다!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "단축키를 통해 콘솔을 열면 이 플러그인과 다른 플러그인의 로그를 볼 수 있습니다"
};
