import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "सबै तस्वीरहरू डाउनलोड गर्नुहोस्",
    "上传全部图片": "सबै तस्वीरहरू अपलोड गर्नुहोस्",

    //utils
    "自动上传": "स्वचालित अपलोड",
    "自动下载": "स्वचालित डाउनलोड",
    "下载文件不是允许的图片类型": "डाउनलोड गर्नको लागि फाइल अनुमत छविको प्रकार होइन",
    "待上传图片不存在": "अपलोड गर्नको लागि तस्वीर अस्तित्वमा छैन",
    "图片文件创建失败:": "तस्वीरको फाइल सिर्जना असफल: ",
    "网络错误,请检查网络是否通畅": "नेटवर्क त्रुटि, कृपया नेटवर्क जाँच गर्नुहोस्",

    // setting
    "通用设置": "सामान्य सेटिङहरू",
    "是否自动上传": "स्वचालित अपलोड सक्षम गर्नुहोस्",
    "如果关闭,您只能手动上传图片": "यदि बन्द गरियो भने, तपाईं केवल म्यानुअल रूपमा तस्वीर अपलोड गर्न सक्नुहुन्छ",
    "是否自动下载": "स्वचालित डाउनलोड सक्षम गर्नुहोस्",
    "如果关闭,您只能手动下载图片": "यदि बन्द गरियो भने, तपाईं केवल म्यानुअल रूपमा तस्वीर डाउनलोड गर्न सक्नुहुन्छ",
    "上传间隔时间": "अपलोड अन्तराल",
    "单位为毫秒,默认设置1s": "यूनिट मिलिसेकेन्ड हो, डिफल्ट सेटिङ 1 सेकेन्ड हो",
    "关闭提示": "सूचनाहरू बन्द गर्नुहोस्",
    "关闭右上角结果提示": "दायाँ माथिको कुनामा परिणाम सूचनाहरू बन्द गर्नुहोस्",
    "下载设置": "डाउनलोड सेटिङहरू",
    "下载域名排除": "डाउनलोड डोमेन बाहिर गर्नुहोस्",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "बाहिर सूचीमा रहेका तस्वीरहरूको ठेगाना डाउनलोड गरिने छैन, प्रत्येक पंक्तिमा एक डोमेन, * वाइल्डकार्डको समर्थन गर्दछ",
    "上传设置": "अपलोड सेटिङहरू",
    "API 地址": "API ठेगाना",
    "Image Api Gateway 地址": "छवि API गेटवे ठेगाना",
    "API 访问令牌": "API पहुँच टोकन",
    "用于访问API的令牌": "API पहुँच गर्नको लागि टोकन",
    "输入您的 API 访问令牌": "तपाईंको API पहुँच टोकन प्रविष्ट गर्नुहोस्",
    "API 服务搭建": "API सेवा सेटअप",
    "项目地址": "परियोजना ठेगाना",
    "是否上传后删除原图片": "अपलोड पछि मूल तस्वीर मेटाउने हो?",
    "在图片上传后是否删除本地原图片": "तस्वीर अपलोड पछि स्थानिय मूल तस्वीर मेटाउने हो?",
    "支持": "सहयोग",
    "捐赠": "दान गर्नुहोस्",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "यदि तपाईंलाई यो प्लगइन मन पर्छ भने, कृपया यसलाई निरन्तर विकासका लागि दान गर्ने बारेमा विचार गर्नुहोस्।",
    "复制 Debug 信息": "डिबग जानकारी प्रतिलिपि गर्नुहोस्",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "डिबग जानकारीलाई क्लिपबोर्डमा प्रतिलिपि गर्नुहोस्, यसले संवेदनशील जानकारी समावेश गर्न सक्छ!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "सहज कुञ्जी प्रयोग गरेर कन्सोल खोल्नुहोस्, तपाईं यस प्लगइन र अन्य प्लगइनहरूको लग देख्न सक्नुहुन्छ"
};
