import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "Скачать все изображения",
    "上传全部图片": "Загрузить все изображения",

    //utils
    "自动上传": "Автоматическая загрузка",
    "自动下载": "Автоматическая загрузка",
    "下载文件不是允许的图片类型": "Этот файл не является допустимым типом изображения для загрузки",
    "待上传图片不存在": "Изображения для загрузки не существуют",
    "图片文件创建失败:": "Ошибка создания файла изображения:",
    "网络错误,请检查网络是否通畅": "Ошибка сети, пожалуйста, проверьте подключение к сети",

    // setting
    "通用设置": "Общие настройки",
    "是否自动上传": "Автоматическая загрузка",
    "如果关闭,您只能手动上传图片": "Если отключено, вы можете загружать изображения только вручную",
    "是否自动下载": "Автоматическая загрузка",
    "如果关闭,您只能手动下载图片": "Если отключено, вы можете загружать изображения только вручную",
    "上传间隔时间": "Интервал загрузки",
    "单位为毫秒,默认设置1s": "Единица измерения — миллисекунды, по умолчанию установлено 1 секунда",
    "关闭提示": "Отключить уведомления",
    "关闭右上角结果提示": "Отключить уведомления в правом верхнем углу",
    "下载设置": "Настройки загрузки",
    "下载域名排除": "Исключенные домены для загрузки",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "Адреса изображений, указанные в списке исключений, не будут загружаться. Укажите по одному домену на строку, поддерживается использование * как подстановочного знака",
    "上传设置": "Настройки загрузки",
    "API 地址": "API адрес",
    "Image Api Gateway 地址": "Адрес шлюза Image API",
    "API 访问令牌": "Токен доступа API",
    "用于访问API的令牌": "Токен, используемый для доступа к API",
    "输入您的 API 访问令牌": "Введите ваш токен доступа API",
    "API 服务搭建": "Настройка API сервиса",
    "项目地址": "Адрес проекта",
    "是否上传后删除原图片": "Удалить оригинальное изображение после загрузки?",
    "在图片上传后是否删除本地原图片": "Удалить ли локальное оригинальное изображение после загрузки?",
    "支持": "Поддержка",
    "捐赠": "Пожертвование",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "Если вам нравится этот плагин, пожалуйста, подумайте о пожертвовании для поддержки дальнейшей разработки.",
    "复制 Debug 信息": "Копировать информацию отладки",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "Копирование информации отладки в буфер обмена. Может содержать конфиденциальные данные!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "Откройте консоль с помощью горячих клавиш, чтобы увидеть журналы этого плагина и других плагинов"
};
