import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "Скачать все изображения",
    "上传全部图片": "Загрузить все изображения",

    //utils
    "自动上传": "Автозагрузка",
    "自动下载": "Автоскачивание",
    "下载文件不是允许的图片类型": "Загруженный файл не является допустимым типом изображения",
    "待上传图片不存在": "Изображение для загрузки не существует",
    "图片文件创建失败:": "Не удалось создать файл изображения, пожалуйста, проверьте права на создание файлов",
    "网络错误,请检查网络是否通畅": "Ошибка сети, пожалуйста, проверьте подключение к сети",

    // setting
    "通用": "Общие настройки",
    "是否自动上传": "Автоматическая загрузка?",
    "如果关闭,您只能手动上传图片": "Если отключено, вы сможете загружать изображения только вручную",
    "是否自动下载": "Автоматическое скачивание?",
    "如果关闭,您只能手动下载图片": "Если отключено, вы сможете скачивать изображения только вручную",
    "上传间隔时间": "Интервал загрузки",
    "单位为毫秒,默认设置1s": "Единица измерения - миллисекунды, значение по умолчанию - 1 секунда",
    "关闭提示": "Отключить уведомления",
    "关闭右上角结果提示": "Отключить уведомления о результатах в правом верхнем углу",
    "下载": "Скачать",
    "下载域名排除": "Исключенные домены для скачивания",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "Изображения с адресов, включенных в список исключений, не будут скачиваться. Один домен на строку, поддерживается символ * для подстановки",
    "上传": "Загрузить",
    "API 地址": "Адрес API",
    "Image api 网关地址": "Адрес Image API Gateway",
    "API 访问令牌": "Токен доступа API",
    "用于访问API的令牌": "Токен для доступа к API",
    "输入您的 API 访问令牌": "Введите ваш токен доступа к API",
    "API 服务搭建": "Настройка API-сервиса",
    "项目地址": "Адрес проекта",
    "是否上传后删除原图片": "Удалить оригинальное изображение после загрузки?",
    "在图片上传后是否删除本地原图片": "Удалить оригинальное изображение с локального устройства после загрузки?",
    "支持": "Поддержка",
    "捐赠": "Пожертвование",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "Если вам нравится этот плагин, пожалуйста, подумайте о пожертвовании для поддержки дальнейшей разработки",
    "复制 Debug 信息": "Копировать информацию для отладки",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "Копировать информацию для отладки в буфер обмена, может содержать конфиденциальные данные!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "Откройте консоль с помощью горячих клавиш, чтобы увидеть логи этого плагина и других плагинов"
};
