import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "ดาวน์โหลดรูปภาพทั้งหมด",
    "上传全部图片": "อัพโหลดรูปภาพทั้งหมด",

    //utils
    "自动上传": "อัพโหลดอัตโนมัติ",
    "自动下载": "ดาวน์โหลดอัตโนมัติ",
    "下载文件不是允许的图片类型": "ไฟล์ที่ดาวน์โหลดไม่ใช่ประเภทภาพที่อนุญาต",
    "待上传图片不存在": "ไม่มีรูปภาพที่ต้องอัพโหลด",
    "图片文件创建失败:": "ไม่สามารถสร้างไฟล์รูปภาพได้ กรุณาตรวจสอบสิทธิ์การสร้างไฟล์",
    "网络错误,请检查网络是否通畅": "ข้อผิดพลาดทางเครือข่าย กรุณาตรวจสอบการเชื่อมต่อเครือข่าย",

    // setting
    "通用": "การตั้งค่าทั่วไป",
    "是否自动上传": "อัพโหลดอัตโนมัติหรือไม่?",
    "如果关闭,您只能手动上传图片": "หากปิดใช้งาน คุณจะสามารถอัพโหลดรูปภาพได้เพียงแบบแมนนวล",
    "是否自动下载": "ดาวน์โหลดอัตโนมัติหรือไม่?",
    "如果关闭,您只能手动下载图片": "หากปิดใช้งาน คุณจะสามารถดาวน์โหลดรูปภาพได้เพียงแบบแมนนวล",
    "上传间隔时间": "ระยะเวลาในการอัพโหลด",
    "单位为毫秒,默认设置1s": "หน่วยเป็นมิลลิวินาที การตั้งค่าเริ่มต้นคือ 1 วินาที",
    "关闭提示": "ปิดการแจ้งเตือน",
    "关闭右上角结果提示": "ปิดการแจ้งเตือนผลลัพธ์ที่มุมขวาบน",
    "下载": "ดาวน์โหลด",
    "下载域名排除": "ยกเว้นโดเมนที่ดาวน์โหลด",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "ที่อยู่ของรูปภาพในรายการยกเว้นจะไม่ถูกดาวน์โหลด ทุกโดเมนในหนึ่งบรรทัด รองรับตัวอักษร * สำหรับตัวแทน",
    "上传": "อัพโหลด",
    "API 地址": "ที่อยู่ API",
    "Image Api Gateway 地址": "ที่อยู่ Image API Gateway",
    "API 访问令牌": "โทเค็นการเข้าถึง API",
    "用于访问API的令牌": "โทเค็นที่ใช้ในการเข้าถึง API",
    "输入您的 API 访问令牌": "กรอกโทเค็นการเข้าถึง API ของคุณ",
    "API 服务搭建": "ตั้งค่าบริการ API",
    "项目地址": "ที่อยู่โครงการ",
    "是否上传后删除原图片": "ลบรูปภาพต้นฉบับหลังจากอัพโหลดหรือไม่?",
    "在图片上传后是否删除本地原图片": "ลบรูปภาพต้นฉบับในเครื่องหลังจากการอัพโหลดหรือไม่?",
    "支持": "การสนับสนุน",
    "捐赠": "การบริจาค",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "หากคุณชื่นชอบปลั๊กอินนี้ กรุณาพิจารณาบริจาคเพื่อสนับสนุนการพัฒนาต่อไป",
    "复制 Debug 信息": "คัดลอกข้อมูลการดีบัก",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "คัดลอกข้อมูลการดีบักไปยังคลิปบอร์ด อาจมีข้อมูลที่ละเอียดอ่อน!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "เปิดคอนโซลโดยใช้คีย์ลัด คุณจะเห็นบันทึกของปลั๊กอินนี้และปลั๊กอินอื่นๆ"
};
