import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "ดาวน์โหลดรูปภาพทั้งหมด",
    "上传全部图片": "อัปโหลดรูปภาพทั้งหมด",

    //utils
    "自动上传": "อัปโหลดอัตโนมัติ",
    "自动下载": "ดาวน์โหลดอัตโนมัติ",
    "下载文件不是允许的图片类型": "ไฟล์ที่ดาวน์โหลดไม่ใช่ประเภทภาพที่อนุญาต",
    "待上传图片不存在": "รูปภาพที่ต้องการอัปโหลดไม่มีอยู่",
    "图片文件创建失败:": "การสร้างไฟล์ภาพล้มเหลว:",
    "网络错误,请检查网络是否通畅": "ข้อผิดพลาดในเครือข่าย กรุณาตรวจสอบการเชื่อมต่อเครือข่าย",

    // setting
    "通用设置": "การตั้งค่าทั่วไป",
    "是否自动上传": "อัปโหลดอัตโนมัติหรือไม่",
    "如果关闭,您只能手动上传图片": "หากปิดคุณจะสามารถอัปโหลดรูปภาพได้ด้วยตัวเองเท่านั้น",
    "是否自动下载": "ดาวน์โหลดอัตโนมัติหรือไม่",
    "如果关闭,您只能手动下载图片": "หากปิดคุณจะสามารถดาวน์โหลดรูปภาพได้ด้วยตัวเองเท่านั้น",
    "上传间隔时间": "ระยะเวลาในการอัปโหลด",
    "单位为毫秒,默认设置1s": "หน่วยเป็นมิลลิวินาที ตั้งค่าเริ่มต้นเป็น 1 วินาที",
    "关闭提示": "ปิดการแจ้งเตือน",
    "关闭右上角结果提示": "ปิดการแจ้งเตือนผลลัพธ์ที่มุมขวาบน",
    "下载设置": "การตั้งค่าการดาวน์โหลด",
    "下载域名排除": "ยกเว้นโดเมนในการดาวน์โหลด",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "ที่อยู่ของรูปภาพในรายการยกเว้นจะไม่ถูกดาวน์โหลด, หนึ่งโดเมนต่อบรรทัด, รองรับ * เป็นตัวแทน",
    "上传设置": "การตั้งค่าการอัปโหลด",
    "API 地址": "ที่อยู่ API",
    "Image Api Gateway 地址": "ที่อยู่ Image API Gateway",
    "API 访问令牌": "โทเค็นการเข้าถึง API",
    "用于访问API的令牌": "โทเค็นสำหรับการเข้าถึง API",
    "输入您的 API 访问令牌": "กรุณากรอกโทเค็นการเข้าถึง API ของคุณ",
    "API 服务搭建": "การตั้งค่าบริการ API",
    "项目地址": "ที่อยู่โปรเจค",
    "是否上传后删除原图片": "ต้องการลบรูปภาพต้นฉบับหลังจากอัปโหลดหรือไม่?",
    "在图片上传后是否删除本地原图片": "ต้องการลบรูปภาพต้นฉบับในเครื่องหลังจากอัปโหลดหรือไม่?",
    "支持": "การสนับสนุน",
    "捐赠": "บริจาค",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "หากคุณชอบปลั๊กอินนี้ โปรดพิจารณาบริจาคเพื่อสนับสนุนการพัฒนาต่อไป",
    "复制 Debug 信息": "คัดลอกข้อมูลการดีบัก",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "คัดลอกข้อมูลการดีบักไปที่คลิปบอร์ด อาจมีข้อมูลที่ละเอียดอ่อน!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "เปิดคอนโซลด้วยทางลัด คุณจะสามารถดูบันทึกของปลั๊กอินนี้และปลั๊กอินอื่นๆ"
};
