import { lang } from "../../lang";

export default <lang>{
    //main
    "下载全部图片": "Завантажити всі зображення",
    "上传全部图片": "Завантажити всі зображення",

    //utils
    "自动上传": "Автоматичне завантаження",
    "自动下载": "Автоматичне завантаження",
    "下载文件不是允许的图片类型": "Завантажений файл не є дозволеним типом зображення",
    "待上传图片不存在": "Зображення для завантаження не існує",
    "图片文件创建失败:": "Не вдалося створити файл зображення:",
    "网络错误,请检查网络是否通畅": "Помилка мережі, перевірте підключення до мережі",

    // setting
    "通用设置": "Загальні налаштування",
    "是否自动上传": "Автоматично завантажувати?",
    "如果关闭,您只能手动上传图片": "Якщо вимкнено, ви зможете завантажувати зображення лише вручну",
    "是否自动下载": "Автоматично завантажувати?",
    "如果关闭,您只能手动下载图片": "Якщо вимкнено, ви зможете завантажувати зображення лише вручну",
    "上传间隔时间": "Інтервал між завантаженнями",
    "单位为毫秒,默认设置1s": "Одиниця вимірювання — мілісекунди, за замовчуванням 1 секунда",
    "关闭提示": "Вимкнути сповіщення",
    "关闭右上角结果提示": "Вимкнути сповіщення про результати в правому верхньому куті",
    "下载设置": "Налаштування завантаження",
    "下载域名排除": "Виключення доменів для завантаження",
    "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "Адреси зображень у списку виключень не будуть завантажуватися, один домен на рядок, підтримується заміна за допомогою символу *",
    "上传设置": "Налаштування завантаження",
    "API 地址": "Адреса API",
    "Image Api Gateway 地址": "Адреса Image API Gateway",
    "API 访问令牌": "Токен доступу API",
    "用于访问API的令牌": "Токен для доступу до API",
    "输入您的 API 访问令牌": "Введіть ваш токен доступу до API",
    "API 服务搭建": "Налаштування сервісу API",
    "项目地址": "Адреса проєкту",
    "是否上传后删除原图片": "Чи потрібно видаляти оригінальне зображення після завантаження?",
    "在图片上传后是否删除本地原图片": "Чи потрібно видаляти оригінальне зображення з локального комп'ютера після завантаження?",
    "支持": "Підтримка",
    "捐赠": "Пожертвування",
    "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "Якщо вам подобається цей плагін, будь ласка, розгляньте можливість зробити пожертвування для підтримки подальшого розвитку.",
    "复制 Debug 信息": "Копіювати інформацію для налагодження",
    "将调试信息复制到剪贴板, 可能包含敏感信!": "Копіювати інформацію для налагодження в буфер обміну, може містити чутливу інформацію!",
    "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "Відкрийте консоль за допомогою гарячих клавіш, щоб побачити журнали цього плагіна та інших плагінів"
};
