// 简体中文
import { lang } from "../../lang";

export default <lang>{
  //main
  "下载全部图片": "下载全部图片",
  "上传全部图片": "上传全部图片",

  //utils
  "自动上传": "自动上传",
  "自动下载": "自动下载",
  "下载文件不是允许的图片类型": "下载文件不是允许的图片类型",
  "待上传图片不存在": "待上传图片不存在",
  "图片文件创建失败:": "本地文件创建错误,请检查是否有创建权限",
  "网络错误,请检查网络是否通畅": "网络错误,请检查网络是否通畅",

  // setting
  "通用": "通用",
  "是否自动上传": "是否自动上传",
  "如果关闭,您只能手动上传图片": "如果关闭,您只能手动上传图片",
  "是否自动下载": "是否自动下载",
  "如果关闭,您只能手动下载图片": "如果关闭,您只能手动下载图片",
  "上传间隔时间": "上传间隔时间",
  "单位为毫秒,默认设置1s": "单位为毫秒,默认设置1s",
  "关闭提示": "关闭提示",
  "关闭右上角结果提示": "关闭右上角结果提示",
  "下载": "下载",
  "下载域名排除": "下载域名排除",
  "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符": "在排除名单内的图片地址不会被下载,一行一个域名,支持 * 通配符",
  "上传": "上传",
  "API 地址": "API 地址",
  "Image api 网关地址": "Image api 网关地址",
  "API 访问令牌": "API 访问令牌",
  "用于访问API的令牌": "用于访问API的令牌",
  "输入您的 API 访问令牌": "输入您的 API 访问令牌",
  "API 服务搭建": "API 服务搭建",
  "项目地址": "项目地址",
  "是否上传后删除原图片": "是否上传后删除原图片",
  "在图片上传后是否删除本地原图片": "在图片上传后是否删除本地原图片",
  "支持": "支持",
  "捐赠": "捐赠",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "如果您喜欢这个插件，请考虑捐赠以支持继续开发。",
  "复制 Debug 信息": "复制 Debug 信息",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "将调试信息复制到剪贴板, 可能包含敏感信!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志":"通过快捷键打开控制台，你可以看到这个插件和其他插件的日志"
};
